IDENTIFICATION DIVISION.
       PROGRAM-ID. AREATRI.
       AUTHOR. ANGEL YURI.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AREA_TRIANGULO   PIC ZZ999.
       01 BASE             PIC 999.
       01 ALTURA           PIC 999.


       PROCEDURE DIVISION.
       CALCUL.
       DISPLAY "DIGITE A BASE DE TRIANGULO: ".
       ACCEPT BASE.
       DISPLAY "DIGITE A ALTURA DO TRIANGULO: ".
       ACCEPT ALTURA.

       COMPUTE AREA_TRIANGULO = (BASE * ALTURA) / 2.

       DISPLAY "A AREA DO TRIANGULO E: " AREA_TRIANGULO.

       STOP RUN.

       END PROGRAM AREATRI.



       
