000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. hello.
000003     AUTHOR. Angel Yuri.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008
000009 PROCEDURE DIVISION.
000010 PRINCIPAL.
000011     DISPLAY "Hello World :3".
000012
000013 STOP RUN.
000014 END PROGRAM hello.
