0001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. HOWRU.
000003     AUTHOR. Angel Yuri.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009
000010 01 NOME    PIC X(020).
000011
000012 01  DATA-ATUAL PIC 9(8).
000013 01  ANO PIC 9999.
000014 01  MES PIC 99.
000015 01  DIA PIC 99.
000016
000017 PROCEDURE DIVISION.
000018 PRINCIPAL.
000019     DISPLAY "Digite seu nome: ".
000020     ACCEPT NOME.
000021     ACCEPT DATA-ATUAL FROM DATE YYYYMMDD.

           MOVE DATA-ATUAL (1:4) TO ANO.
           MOVE DATA-ATUAL (5:2) TO MES.
           MOVE DATA-ATUAL (7:2) TO DIA.

000022     DISPLAY "Bem-vindo(a) " NOME.
000023     DISPLAY "hoje " DIA "/" MES "/"    
            ANO
000024
000025 STOP RUN.
000026 END PROGRAM HOWRU.
